
#ifndef _Rtc_H
#define _Rtc_H
//-----------------------------------------------------------------------------

#include "rtc_ST.h"

//-----------------------------------------------------------------------------
//Структура для хранения параметров времени.
typedef struct 
  {
    uint16_t  hour;   //часы	       
    uint16_t  min;	   //минуты    
    uint16_t  sec;	   //секунды    
  }RtcTimeSTR_Type;
//-----------------------------------------------------------------------------
uint32_t  TimeToRtc(RtcTimeSTR_Type *time);
void      RtcToTime(uint32_t cnt);
RtcTimeSTR_Type* RtcGetTime(void);
//-----------------------------------------------------------------------------
#endif 

