
#ifndef _SB_SirenBoard_H
#define _SB_SirenBoard_H
//***************************************************************************************************

#include "Siren.h"

//***************************************************************************************************
//***************************************************************************************************
typedef struct{
	uint8_t	Out :4; 
	uint8_t Line:4; 
}Line_t;

//Структура ответа платы управления оповещателями на запрос от ЦП.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct {
	//--------------------
	uint16_t PowerVol;//Напряжение питания оповещателей, в мВ.
	Line_t	 Siren1;
	Line_t	 Siren2;
	Line_t	 Siren3;
	//--------------------	
}SBData_t;
#pragma pack(pop)//вернули предыдущую настройку.
#define SB_DATA_SIZE  ((uint8_t)sizeof(SBData_t))
//***********************************************
//Команды платы управления оповещателями(Siren Board - SB).
#define SB_TYPE			(uint8_t)0x05

#define SB_CMD_SET	(uint8_t)0x01    //
//***************************************************************************************************
//***************************************************************************************************
void SaveDataFromMB(uint8_t* dataBuf);
Line_t* DataFromMB(uint8_t line);
void SirenBoard_BuildingPackForRS485(uint8_t *dataBuf);

//***************************************************************************************************
//***************************************************************************************************
#endif /*_SB_SirenBoard_H*/




