
#ifndef _Rtc_H
#define _Rtc_H
//-----------------------------------------------------------------------------

#include "rtc_ST.h"

//-----------------------------------------------------------------------------
//Структура для хранения параметров времени.
typedef struct 
  {
    uint16_t  hour;   //часы	       
    uint16_t  min;	   //минуты    
    uint16_t  sec;	   //секунды    
  }RtcTimeSTR;
//-----------------------------------------------------------------------------

uint32_t  TimeToRtc(RtcTimeSTR *time);
void      RtcToTime(uint32_t cnt, RtcTimeSTR *time);

//-----------------------------------------------------------------------------
#endif 

