
#ifndef _FP_FacePanel_H
#define _FP_FacePanel_H

//*********************************************************************************
#include "stm32f10x.h"
//*********************
//AppLayer.
#include "Buttons.h"
//*********************************************************************************
//*********************************************************************************
//Структура ответа лицевой панели на запрос от ЦП.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	//--------------------
	uint32_t TimeUTC;        //Время в формате UTC.
	uint8_t  Mic;			 			 //Состояние микрофона
	uint8_t  Key;			 			 //Положение ключа.
	uint8_t  Address;        //Адресс блока.        
	uint8_t  Group;          //Группа блока.  
	uint8_t  Control_Buttons;//Состояние кнопок управления.
	uint8_t  Alg_Buttons;    //Состояние кнопок АЛГОРИТМЫ ОПОВЕЩЕНИЯ.
	//--------------------
}FPData_t;
#pragma pack(pop)//вернули предыдущую настройку.
//********************************************************
#define FP_TYPE             			0x02 //Тип модуля - лицевая панель.
//Команды FP.
#define FP_CMD_SEND_STATUS        0x11 //Команда "Выдача статуса от FP".
#define FP_CMD_SET_ADDRES			    0x12 //Команда установки адрес блока
#define FP_CMD_SET_GROUP		      0x13 //Команда устновки группы блока 
#define FP_CMD_SET_TIME			      0x14 //Команда установики времени
#define FP_CMD_SET_DATA		        0x15 //Команда установики времени
#define FP_CMD_TEST_ZUMMER		    0x16 //Команда влючение тестирования зуммера ЦП
#define FP_CMD_LC_SAVE_REF        0x17 //Команда сохранения опорных значений для Lc.
#define FP_CMD_GET_LOG		        0x18 //Команда получения одного события из журнала событий
#define FP_CMD_GET_INPUT_CONFIG		0x19 //Команда получени параметров одного входа пожарного шлейфа.
#define FP_CMD_SET_INPUT_CONFIG	  0x20 //Команда сохранения параметров одного входа пожарного шлейфа.
#define FP_CMD_SET_POWER_CHECK	  0x21 //Команда сохранения контроля питания блока.
//********************************************************
//Положение ключа - Режима работы блока.
#define NO_KEY						 0
#define KEY_LOCK_STATE	   1
#define KEY_CONTROL_STATE  2
#define KEY_CONFIG_STATE	 3
//Состояния микрофона.
#define MIC_CONNECTED 	   1 // (1<<4)//микрофон подключен
#define MIC_ACTIVE  		   2 // (2<<4)//на микрофоне нажата тангента, можно говорить.
#define MIC_NOT_CONNECT	   3 // (3<<4)//микрофон не подключен
#define MIC_FAULT          4 // (4<<4)//капсуль микрофона неисправен.   
//*****************************************************************************
//*****************************************************************************
//Данные лицевой панели
void 			FacePanelSaveData(uint8_t *dataBuf);
FPData_t* FacePanel(void);
//*****************************************************************************
//*****************************************************************************
#endif /*_FP_FacePanel_H*/


