
#include "Relay.h"

//*************************************************************************************************
static uint16_t	StpicReg = 0;
//*************************************************************************************************
//*************************************************************************************************
static void Pause(volatile uint32_t pause){

	while(pause--);
}
//*****************************************************************************
void Relay_Init(void){

	//Включаем тактирование порта C.
  RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;
	//Управление сдвиговыми регистрами. PC7(STPIC_CS), PC8(STPIC_CLR).
	GPIOC->CRL &= ~GPIO_CRL_CNF7;
	GPIOC->CRL |= GPIO_CRL_MODE7;//PC7(STPIC_CS) - выход, режим - push-pull.
															 //PC7(STPIC_CS) - тактирование 50МГц.
	GPIOC->CRH &= ~GPIO_CRH_CNF8;	
	GPIOC->CRH |= GPIO_CRH_MODE8;//PC8(STPIC_CLR)- выход, режим - push-pull.
															 //PC8(STPIC_CLR)- тактирование 50МГц.
	//--------------------	
	STPIC6C595CS_High();
	STPIC6C595CLR_High();

	Spi2_Init();
}
//*****************************************************************************
//Обновление реле.
void Relay_UpdateLoop(void){
	
	STPIC6C595CS_Low();
	Pause(10);
	
	Spi2_TxRxByte(StpicReg >> 8);
	Spi2_TxRxByte(StpicReg);
	
	STPIC6C595CS_High();
	
	//Такая последовательность тоже работает стабильно.
//	STPIC6C595CS_Low();
//	Pause(5);
//	STPIC6C595CS_High();
}  
//*****************************************************************************
void Relay_On(uint16_t relay){

	StpicReg |= relay;
}
//*****************************************************************************
void Relay_Off(uint16_t relay){

	StpicReg &= ~relay;
}
//*****************************************************************************
uint16_t Relay_GetState(void){

	return StpicReg;
}
//*****************************************************************************
//Управление светодиодом RS485Act.
void LedRs485Act(uint8_t state){

	if(state) StpicReg |=  LED_RS485_ACT; 
	else      StpicReg &= ~LED_RS485_ACT;
}
//*************************************************************************************************
//*************************************************************************************************




















