
#ifndef _sys_ST_H
#define _sys_ST_H
//-----------------------------------------------------------------------------

#include "stm32f10x.h"
#include "lcd12864.h"
//-----------------------------------------------------------------------------
//Как же определить свободную страницу? Это зависит от размера прошивки. 
//Обычно используют последнюю страницу в памяти. 
//Её адрес можно вычислить как [начальный адрес] + [номер страницы - 1] * [размер страницы].
//Выберем 16 страницу: 0x0800 0000 + 15 * 0x0000 0400 = 0x0800 3C00
#define SETTINGS_PAGE 0x08003C00  //

//-----------------------------------------------------------------------------
uint32_t InitRCC(void);
void     SysInit(void);

void     Internal_Flash_Erase(uint32_t pageAddress);
void     Internal_Flash_Write(unsigned char* data, uint32_t address, unsigned int count);
uint8_t  Internal_Flash_Read(uint32_t address);
//-----------------------------------------------------------------------------
#endif /*_sys_ST_H*/

