
#ifndef _crc16_H
#define _crc16_H
//-----------------------------------------------------------------------------

//#include "stm32f10x.h"
#include "stm32f0xx.h"

//-----------------------------------------------------------------------------
// Расчет CRC16 при помощи встроенного модуля.
//void CRCInit(void);
//uint16_t GetCrc16(uint8_t *buffer, uint8_t buff_len);


// Расчет CRC16 по полиному 0x8005 с 0 начальным значением
uint16_t Get_Crc16(uint8_t *pcBlock, uint8_t len);
//-----------------------------------------------------------------------------
#endif /*_crc16_H*/

