
#ifndef _uart_ST_H
#define _uart_ST_H
//*********************************************************************************

//#include "stm32f10x.h"
#include "stm32f0xx.h"

//*********************************************************************************
//*********************************************************************************
//Указатели обработчиков событий
typedef struct{
	//--------
	uint8_t (*ReceiveByte)        (uint8_t byte);//Обработчик приема байта.
  void    (*ReceiveByteBroken)  (void);   		 //Обработчик битого байта.
	void    (*BufTransferComplete)(void);        //Окончание передачи буфера.
	//--------
}UxHandlers_t;
//****************************************************
//Рабочие переменные.
typedef struct{
	//--------------------
	volatile uint16_t CounterByte;//Счетчик переданных байт. 
	volatile uint8_t  BufSize;    //Количество передаваемых байт.
	volatile uint8_t *BufPtr;     //Указатель на передающий буфер.
	//--------------------
}UxWorkReg_t;
//*********************************************************************************
//Аппатартный уровень.
void 					Usart1_Init(uint16_t usartBrr);
void 					Usart1_StartTx(uint8_t *TxBuf, uint16_t size);
UxHandlers_t* Usart1_Handlers(void);
//*********************************************************************************
//*********************************************************************************
#endif 

















