
#ifndef _uart_ST_H
#define _uart_ST_H
//-----------------------------------------------------------------------------

#include "stm32f10x.h"

//-----------------------------------------------------------------------------
//Указатели обработчиков событий
typedef struct{
	//--------
	uint8_t (*ReceiveByte)        (uint8_t byte);//Обработчик приема байта.
  void    (*ReceiveByteBroken)  (void);   		 //Обработчик битого байта.
	void    (*BufTransferComplete)(void);        //Окончание передачи буфера.
	//--------
}UxHandlers_t;
//****************************************************
//Рабочие переменные.
typedef struct{
	//--------------------
	volatile uint16_t CounterByte;//Счетчик переданных байт. 
	volatile uint8_t  BufSize;    //Количество передаваемых байт.
	volatile uint8_t *BufPtr;     //Указатель на передающий буфер.
	//--------------------
}UxWorkReg_t;
//-----------------------------------------------------------------------------
//Аппатартный уровень.
void Uart1_Init  (void);
void Uart1_StarTx(uint8_t *TxBuf, uint8_t size);

void 					Uart3_Init   (uint16_t usartBrr);
UxHandlers_t* Uart3_Handler(void);
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
#endif 

















